InformationRegisters/ЭкипировкаПерсонажей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ЭкипировкаПерсонажей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Экипировка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЭкипировки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РегистрПредметов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрПредметов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначениеХарактеристикИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ЗначениеХарактеристикИгроков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыХарактеристикИгроков</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыХарактеристикИгроков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХарактеристикиЭкипировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиЭкипировки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметЭкипировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыХарактеристикПредметов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭкипировкаПерсонажей/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Отбор") тогда
		Если Параметры.Отбор.Свойство("Игрок") тогда
			РеквизитТекущийИгрок = Параметры.Отбор.Игрок;
			ЭлементОтбора = Параметры.Отбор;
			Элементы.Игрок.Видимость = Ложь;
			ПараметрыФормы = Параметры.Отбор;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Парам = Новый Структура;
	Парам.Вставить("Игрок", РеквизитТекущийИгрок);
	Парам.Вставить("Экипировка", Элементы.Экипировка.Родитель.ТекущиеДанные.Экипировка);
	РеквизитТипПредмета = Элементы.Экипировка.Родитель.ТекущиеДанные.Экипировка;
	РеквизитПредмет = Элементы.Предмет.Родитель.ТекущиеДанные.Предмет;
	Оповещение = Новый ОписаниеОповещения("СписокОбработкаВыбораНаСервере", ЭтотОбъект);
	ОткрытьФорму("РегистрНакопления.РегистрПредметов.Форма.ФормаВыбора", Парам, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	СписокВыборНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокВыборЗначенияНаСервере()
	Сообщить("1");
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СписокВыборЗначенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокОбработкаВыбораНаСервере(Предмет, чтото) экспорт
	Если ТипЗнч(Предмет) = Тип("СправочникСсылка.Предметы") и Предмет <> Неопределено тогда
		МенеджерЗаписи = РегистрыСведений.ЭкипировкаПерсонажей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Игрок = РеквизитТекущийИгрок;
		МенеджерЗаписи.Экипировка = РеквизитТипПредмета;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() тогда
			МенеджерЗаписи.Предмет = Предмет;
			МенеджерЗаписи.Записать();
		КонецЕсли; 
		Элементы.Список.Обновить();
	Иначе
		МенеджерЗаписи = РегистрыСведений.ЭкипировкаПерсонажей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Игрок = РеквизитТекущийИгрок;
		МенеджерЗаписи.Экипировка = РеквизитТипПредмета;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() тогда
			МенеджерЗаписи.Предмет = Неопределено;
			МенеджерЗаписи.Записать();
		КонецЕсли;                                 
		Элементы.Список.Обновить();
		Сообщить("Вы не выбрали привет!");
	КонецЕсли;
	ОбработатьИзмененияЭкипировки(Предмет);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СписокОбработкаВыбораНаСервере(Элемент, Истина);
КонецПроцедуры

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьХарактеристикиПредмета(Предмет)
	Если Предмет = Неопределено тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначениеХарактеристикИгроков.Характеристика КАК Характеристика,
		|	ЗначениеХарактеристикИгроков.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначениеХарактеристикИгроков КАК ЗначениеХарактеристикИгроков
		|ГДЕ
		|	ЗначениеХарактеристикИгроков.Игрок = &Игрок";
	Запрос.УстановитьПараметр("Игрок", РеквизитТекущийИгрок);          
	ХарактеристикиИгрока = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиЭкипировки.Характеристика КАК Характеристика,
		|	ХарактеристикиЭкипировки.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ХарактеристикиЭкипировки КАК ХарактеристикиЭкипировки
		|ГДЕ
		|	ХарактеристикиЭкипировки.ПредметЭкипировки = &Предмет";
	Запрос.УстановитьПараметр("Предмет", Предмет);      
	ХарактеристикиПредмета = Запрос.Выполнить().Выгрузить(); 
	
	НаборЗаписей = РегистрыСведений.ЗначениеХарактеристикИгроков.СоздатьНаборЗаписей();
	
	Для каждого ХарактеристикаИгрока из ХарактеристикиИгрока Цикл                                                              
		Попытка
			ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикПредметов.НайтиПоНаименованию(ХарактеристикаИгрока.Характеристика.Наименование);
		Исключение
			продолжить;
		КонецПопытки;
		Попытка
			ХарактеристикаПредмета = ХарактеристикиПредмета.НайтиСтроки(Новый Структура("Характеристика", ВидХарактеристики))[0];	
		Исключение
			ХарактеристикаПредмета = Новый Структура("Значение", 0);
		КонецПопытки;
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Игрок = РеквизитТекущийИгрок;
		НоваяЗапись.Характеристика = ХарактеристикаИгрока.Характеристика;
		НоваяЗапись.Значение = ХарактеристикаИгрока.Значение + ХарактеристикаПредмета.Значение; 
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

&НаСервере
Процедура ВычестьХарактеристикиПредмета(Предмет)
	Если Предмет = Неопределено тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначениеХарактеристикИгроков.Характеристика КАК Характеристика,
		|	ЗначениеХарактеристикИгроков.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначениеХарактеристикИгроков КАК ЗначениеХарактеристикИгроков
		|ГДЕ
		|	ЗначениеХарактеристикИгроков.Игрок = &Игрок";
	Запрос.УстановитьПараметр("Игрок", РеквизитТекущийИгрок);          
	ХарактеристикиИгрока = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиЭкипировки.Характеристика КАК Характеристика,
		|	ХарактеристикиЭкипировки.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ХарактеристикиЭкипировки КАК ХарактеристикиЭкипировки
		|ГДЕ
		|	ХарактеристикиЭкипировки.ПредметЭкипировки = &Предмет";
	Запрос.УстановитьПараметр("Предмет", Предмет);      
	ХарактеристикиПредмета = Запрос.Выполнить().Выгрузить(); 
	
	НаборЗаписей = РегистрыСведений.ЗначениеХарактеристикИгроков.СоздатьНаборЗаписей();
	
	Для каждого ХарактеристикаИгрока из ХарактеристикиИгрока Цикл                                                              
		Попытка
			ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикПредметов.НайтиПоНаименованию(ХарактеристикаИгрока.Характеристика.Наименование);
		Исключение
			продолжить;
		КонецПопытки;
		Попытка
			ХарактеристикаПредмета = ХарактеристикиПредмета.НайтиСтроки(Новый Структура("Характеристика", ВидХарактеристики))[0];	
		Исключение
			ХарактеристикаПредмета = Новый Структура("Значение", 0);
		КонецПопытки;
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Игрок = РеквизитТекущийИгрок;
		НоваяЗапись.Характеристика = ХарактеристикаИгрока.Характеристика;
		НоваяЗапись.Значение = ХарактеристикаИгрока.Значение - ХарактеристикаПредмета.Значение; 
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененияЭкипировки(НовыйПредмет)
	// если остался тот же предмет или его не было и новый не выбрали
	Если НовыйПредмет.Наименование = РеквизитПредмет.Наименование тогда
		Возврат;
	//	если экипировки не было но ей выбрали	
	ИначеЕсли ПустаяСтрока(РеквизитПредмет.Наименование) и не ПустаяСтрока(НовыйПредмет.Наименование) тогда
		ДобавитьХарактеристикиПредмета(НовыйПредмет);	
	//	если экипировка была и её убрали
	ИначеЕсли не ПустаяСтрока(РеквизитПредмет.Наименование) и ПустаяСтрока(НовыйПредмет.Наименование) тогда
		ВычестьХарактеристикиПредмета(РеквизитПредмет);
	// если экипировка была и выбрали другую
	ИначеЕсли не ПустаяСтрока(РеквизитПредмет.Наименование) и не ПустаяСтрока(НовыйПредмет.Наименование) тогда
		ВычестьХарактеристикиПредмета(РеквизитПредмет);
		ДобавитьХарактеристикиПредмета(НовыйПредмет);
	КонецЕсли;  
КонецПроцедуры

#КонецОбласти
